import random
# 导入random 模块

# 报名人员列表
l = ['吴词钊', '李陵', '范静童', '张锦航', '邹宇骞', '徐家乐', '张子涵', '詹天浩', '申旭辉', '赵俊辉', ' 肖世豪', '周瑞涛', '曾广旭', '魏焱飞', '饶卓', '尚紫扬', '袁心茹', '陶梦芸', '张优悠', '赵宇航', '柴晶', '平荣艳', '孙佳浩', '曾博', '林传恩', '汪顺烨', '胡正涛', '禇晨阳']

r = [i for i in l if l.count(i) > 1]

if r:
    print("报名人员列表中有重复人员，请检查！")
    exit()

# 随机种子 计算如下
# 当天日期 如 20230303
day = 20230317
# 报名人数 如 10
sum = len(l)
# 抽出人数 如 3
num = 2

# 随机种子 = 当天日期 * 报名人数 * 抽出人数
seed = day * sum * num
# 设置随机种子
random.seed(seed)


# 抽出人员列表
result = random.sample(l, num)

s = f"""报名人数：{sum}人\t抽出人数：{num}人
随机种子：{seed} = {day} * {sum} * {num}
报名列表：{l}

抽取人员：{result}"""

print(s)
